<template>
  <div>
    <dl v-for="(item,index) in textlist" :key="index">
      <dl>
        <h3>{{item.title}}</h3>
      </dl>
      <dd v-for="(text,index2) in item.content" :key="index2">
        {{text}}
      </dd>
    </dl>
  </div>
</template>

<script>
    export default {
        name: "Newbie",
      data(){
          return{
            textlist:
              [{
              title:"一、会员注册：",content:["1.在首页点击免费注册或者在登录页点击立即注册跳转至注册页面",
                  "2.输入手机号，发送验证码并填写","3.账户名：自定义用户名","4.密码：为数字和字母混合组合，长度必须6-12位，不能为纯字母和数字",
                  "5.确认密码：必须与第一次输入的密码一致","6.点击立即注册按钮提交，即可注册成功"
                ]},{
                title:"二、用户登录：",content:["1.在首页头部点击 ‘登录’ 链接 跳转至登录页面 ",
                  "2.输入账户名或者绑定的手机号","3.输入密码","4.刷新自动生成验证码并填写",
                  "5.点击登录按钮，登录成功后前往首页"
                ]},{
                title:"三、找回密码：",content:["1.在登录时，忘记密码，可以点击登录页右下角的 ‘忘记密码’ 链接 跳转至找回密码页面",
                  "2.输入账号绑定的手机号","3.填写自动生成的验证码","4.发送短信验证码，并填写","5.重置验证码","6.返回登录页进行登录"
                ]},{
                title:"四、常见问题：",content:["1.积分是如何获得？","2.积分可以干什么？","3.兑换流程是什么？"
                ]},{
                title:"五、兑换流程：",content:["1."
                ]},{
                title:"六、配送方式：",content:["1.选择一个商品加入购物车或者立即购买，填写订单信息",
                  "2.选择配送方式，支付方式，收货地址","3.提交订单"
                ]}]
          }
      }
    }
</script>

<style scoped>
dd{
  font-family: "宋体";
  margin-bottom: 10px;
}
</style>
